---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RasterHorizontalScale
source: html/387cc0c1-0b0e-3ab1-2ad2-1aad8490c618.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RasterHorizontalScale Property

"Horizontal Scale"

## Syntax (C#)
```csharp
public static ForgeTypeId RasterHorizontalScale { get; }
```